Repository: ExternalRepositories/autovala
Catalog: po/*.po
Languages: es

source: Failed to write data to debian/preinst file (%s)
es: Incapaz de escribir datos en el fichero debian/preinst (%s)

source: Failed to delete invalid debian/preinst file (%s)
es: No se ha podido borrar el fichero no válido debian/preinst (%s)

source: Failed to write data to debian/prerm file (%s)
es: Incapaz de escribir datos en el fichero debian/prerm (%s)

source: Failed to delete invalid debian/prerm file (%s)
es: No se ha podido borrar el fichero no válido debian/prerm (%s)

source: Failed to write data to debian/postinst file (%s)
es: Incapaz de escribir datos en el fichero debian/postinst (%s)

source: Failed to delete invalid debian/postinst file (%s)
es: No se ha podido borrar el fichero no válido debian/postinst (%s)

source: Failed to write data to debian/postrm file (%s)
es: Incapaz de escribir datos en el fichero debian/postrm (%s)

source: Failed to delete invalid debian/postrm file (%s)
es: No se ha podido borrar el fichero no válido debian/postrm (%s)

source: Failed to write data to debian/compat file (%s)
es: Incapaz de escribir datos en el fichero debian/compat (%s)

source: Failed to delete invalid debian/compat file (%s)
es: No se ha podido borrar el fichero no válido debian/compat (%s)

source: Failed to delete old debian/changelog file (%s)
es: No se ha podido borrar el fichero debian/changelog (%s)

source: Failed to write data to debian/changelog file (%s)
es: Incapaz de escribir datos en el fichero debian/changelog (%s)

source: Failed to delete invalid debian/changelog file (%s)
es: No se ha podido borrar el fichero no válido debian/changelog (%s)

source: Failed to launch pacman for the file %s
es: Incapaz de lanzar pacman para el fichero %s

source: Error %d when launching pacman for the file %s
es: Error %d al lanzar pacman para el fichero %s

source: Exception '%s' when launching pacman for the file %s
es: Excepción '%s' al lanzar pacman para el fichero %s

source: Failed to spawn CURL when creating PACMAN package: %s
es: No se ha podido lanzar CURL durante la creación del paquete PACMAN: %s

source: Failed to create PKGBUILD file: %s
es: No se ha podido crear el fichero PKGBUILD: %s

source: Failed to delete PKGBUILD file: %s
es: No se ha podido borrar el fichero PKGBUILD: %s

source: Failed to download %s
es: No se ha podido descargar %s

source: Failed to launch rpm for the file %s
es: Incapaz de lanzar rpm para el fichero %s

source: Error %d when launching rpm for the file %s
es: Error %d al lanzar rpm para el fichero %s

source: Exception '%s' when launching rpm for the file %s
es: Excepción '%s' al lanzar rpm para el fichero %s

source: Failed to delete rpmbuild/SPECS/SPEC file (%s)
es: No se ha podido borrar el fichero rpmbuild/SPECS/SPEC (%s)

source: Failed to delete rpmbuild/SPECS/control file (%s)
es: No se ha podido borrar el fichero rpmbuild/SPECS/control (%s)

source: Failed to write data to rpmbuild/SPECS/SPEC file (%s)
es: Incapaz de escribir datos en el fichero rpmbuild/SPECS/SPEC (%s)

source: Open
es: Abrir

source: New executable/library
es: Nuevo ejecutable/biblioteca

source: Edit library properties
es: Editar propiedades de la biblioteca

source: Edit executable properties
es: Editar propiedades del ejecutable

source: Remove library
es: Borrar biblioteca

source: Remove executable
es: Borrar ejecutable

source: Creates a new Autovala project
es: Crea un nuevo proyecto de Autovala

source: Refreshes the Autovala project
es: Refresca el proyecto de Autovala

source: Updates the project and rebuilds the CMake files
es: Actualiza el proyecto y regenera los ficheros de CMake

source: Builds the Autovala project
es: Compila el proyecto de Autovala

source: Updates the language translation files
es: Actualiza las traducciones

source: Don't show hiden files
es: No mostrar ficheros ocultos

source: Show hiden files
es: Mostrar ficheros ocultos

source: Rename
es: Renombrar

source: Delete
es: Borrar

source: Create file
es: Crear fichero

source: Create folder
es: Crear directorio

source: Untitled file
es: Fichero sin título

source: Untitled folder
es: Directorio sin título

source: %s <b>(Project file)</b>
es: %s <b>(Fichero de proyecto)</b>

source: %s <b>(executable)</b>
es: %s <b>(ejecutable)</b>

source: %s <b>(library)</b>
es: %s <b>(biblioteca)</b>

source: Refreshing project file
es: Refrescando el proyecto

source: Global search:
es: Búsqueda global:

source: Search
es: Buscar

source: Case sensitive
es: Coincidir con capitalización

source: Found element at line %d
es: Encontrado elemento en la línea %d

source: Search result for file %s: found %d occurrences
es: Resultados de la búsqueda para el fichero %s: encontradas %d ocurrencias

source: Binary properties
es: Propiedades el binario

source: Binary name:
es: Nombre del binario:

source: Type:
es: Tipo:

source: Executable
es: Ejecutable

source: Library
es: Biblioteca

source: Folder with sources:
es: Directorio con las fuentes:

source: Vala compile options:
es: Opciones de compilación de Vala:

source: C compile options:
es: Opciones de compilación de C:

source: C libraries:
es: Librerias de C:

source: New Autovala project
es: Nuevo proyecto de Autovala

source: Project name:
es: Nombre del proyecto:

source: Project folder:
es: Carpeta del proyecto:
