Repository: ExternalRepositories/autovala
Catalog: po/*.po
Languages: es

source: Autovala. Usage: autovala help: shows this help. autovala version: shows the current version. autovala init project_name: initializates a new Vala CMake project and creates an initial project file. autovala ginit project_name: initializates a new Genie CMake project and creates an initial project file. autovala refresh: tries to guess the type for each file in the folders and adds them to the project file. autovala cmake: creates the CMake files from the project file. autovala meson: creates the meson.build files from the project file. autovala update: the same than 'refresh' + 'cmake' + 'meson'. autovala po: updates translatable strings. autovala clear: removes the automatic parts in the project file, leaving only the manual ones. autovala project_files: lists all the files belonging to the project (with paths relative to the project's root). autovala git: adds to git all the project files. autovala deb: creates the 'debian' folder for packaging the project as a .deb package. autovala rpm: creates the 'rpmbuild' folder for packaging the project as a .rpm package. autovala pacman: creates a package for PACMAN package manager. autovala valama: exports the project to a VALAMA project file. autovala external owner_id: shows the external data of the specified owner.
es: Autovala: uso: autovala help: muestra esta ayuda. autovala version: muestra la versión actual. autovala init nombre_proyecto: inicializa Vala y CMake, y crea un fichero de proyecto inicial. autovala ginit nombre_proyecto: inicializa un proyecto de Genie, y crea un fichero de proyecto inicial. autovala refresh: intenta adivinar el tipo de cada fichero en las carpetas y los añade al fichero de proyecto. autovala cmake: crea los ficheros para CMake a partir del fichero de proyecto. autovala meson: crea los ficheros para Meson a partir del fichero de proyecto. autovala update: mismo resultado que 'refresh' + 'cmake' + 'meson'. autovala po: actualiza las cadenas traducibles. autovala clear: elimina las partes automáticas en el fichero de proyecto, dejando sólo las añadidas manualmente. autovala project_files: lista todos los ficheros pertenecientes al proyecto (con sus rutas relativas a la raíz del proyecto). autovala git: añade a git todos los ficheros pertenecientes al proyecto. autovala deb: crea la carpeta 'debian' para empaquetar el proyecto como un paquete .deb. autovala rpm: crea la carpeta 'rpmbuild' para empaquetar el proyecto como un paquete .rpm. autovala pacman: crea un paquete para el gestor de paquetes PACMAN. autovala valama: exporta el proyecto a un fichero de proyecto apto para VALAMA. autovala external id_usuario: muestra los datos externos del usuario indicado.

source: Aborting
es: Abortando

source: Done
es: Hecho

source: Failed to launch GIT: %s
es: No se ha podido ejecutar GIT: %s

source: Updating project file
es: Actualizando el fichero de proyecto

source: Updating CMake files
es: Actualizando los ficheros de CMake

source: Updating Meson files
es: Actualizando los ficheros de Meson

source: Failed to create the folder %s
es: Falló la creación del directorio %s

source: Failed to delete the old valama Config.vala file at %s
es: No se ha podido borrar el viejo fichero Config.vala de valama en %s

source: Failed to write to valama Config.vala file at %s
es: Falló la creación del fichero Config.vala para valama en %s

source: Failed to delete the old valama project file %s
es: No se ha podido borrar el viejo fichero de configuración de valama %s

source: Failed to write to valama project file %s
es: Incapaz de escribir datos en el fichero de proyecto de valama %s

source: Can't copy folder %s to %s; it doesn't exist.
es: No es posible copiar la carpeta %s a %s; no existe.

source: Failed when creating folder %s
es: Incapaz de crear el fichero %s

source: Failed when copying recursively the folder %s to %s
es: Ha fallado la copia recursiva del directorio %s a %s

source: Failed when copying the file %s to %s
es: Incapaz de copiar el fichero %s a %s

source: Failed when deleting recursively the folder %s
es: Ha fallado el borrado recursivo del directorio %s

source: Failed when deleting the file %s
es: Incapaz de borrar el fichero %s

source: The folder '%s' already exists
es: El directorio %s ya existe

source: Can't create the folder '%s'
es: No se ha podido crear el directorio %s

source: Can't create the file '%s'
es: No se ha podido crear el fichero '%s'

source: Copying CMAKE scripts from %s
es: Copiando los scripts de CMAKE desde %s

source: Folder %s doesn't exist. Autovala is incorrectly installed
es: La carpeta %s no existe. Autovala está instalado incorrectamente

source: There's already a project in folder %s
es: Ya existe un proyecto en el directorio %s

source: Failed to list path %s
es: Incapaz de listar el directorio %s

source: The 'cmake' folder already exists
es: El directorio 'cmake' ya existe

source: Can't create the initial source file
es: No se ha podido crear el fichero fuente inicial

source: Failed to find the following dependencies for '%s' in meson:
es: No se han podido encontrar las dependencias de %s en meson:

source: Failed to write to meson.build at '%s' element, at '%s' path: %s
es: Fallo la escritura a meson.build en el elemento '%s', en la ruta '%s': %s

source: The following local dependencies cannot be satisfied:
es: No se han podido satisfacer las siguientes dependencias locales:

source: Library %s, packages:
es: Biblioteca %s, paquetes:

source: Binary %s, packages:
es: Binario %s, paquetes:

source: Failed while generating the main CMakeLists.txt file
es: Falló la creación del fichero CMakeLists.txt principal

source: Failed while generating the CMakeLists.txt files: %s
es: Falló la creación de los ficheros CMakeLists.txt: %s

source: Launching command %s
es: Lanzando el comando %s

source: Failed to run 'xgettext' to generate the base POT file
es: No se ha podido ejecutar 'xgettext' para crear el fichero POT base

source: Command output: %s
es: Salida del comando: %s

source: Error output: %s
es: Salida de error: %s

source: Failed to run msgmerge
es: Incapaz de ejecutar msgmerge

source: Command output: %s Error output: %s
es: Salida del comando: %s Salida de error: %s

source: Failed to get the files inside %s
es: Falló la obtención de los ficheros de dentro de %s

source: The path can't be the project's root path
es: La ruta no puede estar en la raíz del proyecto

source: The selected path is outside the project folder
es: La ruta escogida está fuera de la carpeta del proyecto

source: Path already in use in other element
es: La ruta ya está asignada a otro elemento

source: Name already in use in other executable or library
es: Otro ejecutable o biblioteca tiene asignado ese nombre

source: The element doesn't exist
es: El elemento no existe

source: Nested IFs not allowed (line %d)
es: No se permiten IFs anidados (linea %d)

source: Mismatched END (line %d)
es: END sin IF (linea %d)

source: Mismatched ELSE (line %d)
es: ELSE sin IF (linea %d)

source: Global version number must be in the form X.Y or X.Y.Z, being X, Y and Z numbers with one or more digits (line %d)
es: El número global de versión tiene que estar en formato X.Y o X.Y.Z, siendo X, Y y Z números de uno o más dígitos (línea %d)

source: Vala version can't be conditional (line %d)
es: La versión de Vala no puede ser condicional (linea %d)

source: Vala version string not valid. It must be in the form N.N or N.N.N (line %d)
es: La cadena de versión de Vala no es válida. Tiene que ser de la forma N.N o N.N.N (línea %d)

source: This project needs Vala version %s or greater, but you have version %d.%d. Can't open it.
es: Este proyecto necesita la versión %s o superior de Vala, pero está instalada la versión %d.%d. No es posible abrirlo.

source: This project was created with a newer version of Autovala. Can't open it.
es: Este proyecto se creó con una versión de Autovala más reciente. No es posible abrirlo.

source: Can't open configuration file
es: No se ha podido abrir el fichero de configuración

source: IF without END in line %d
es: IF sin END en la línea %d

source: Conditionals are not supported in this statement (line %d)
es: No se admiten condicionales en este comando (linea %d)

source: Can't store the configuration. Project name not defined.
es: No se puede guardar la configuración. No se ha especificado un nombre de proyecto.

source: Can't store the configuration. Path not defined.
es: No se puede guardar la configuración. No se ha definido una ruta.

source: Failed to delete the old config file %s
es: No se ha podido borrar el viejo fichero de configuración %s

source: Storing configuration in file %s
es: Almacenando la configuración en el fichero %s

source: Can't create the config file %s
es: No se ha podido crear el fichero de configuración %s

source: Invalid command %s after command %s (line %d)
es: El comando %s no es válido tras el comando %s (linea %d)

source: Failed to add file %s
es: Incapaz de añadir el fichero %s

source: Directory %s doesn't exist
es: El directorio %s no existe

source: Can't access folder %s
es: No ha sido posible acceder al directorio %s

source: Trying to add an empty path: %s
es: Intentando añadir una ruta vacía: %s

source: Trying to add twice the path %s
es: Intentando añadir dos veces la ruta %s

source: File %s doesn't exist
es: El fichero %s no existe

source: File %s is located at the project's root. Autovala doesn't allow that. You should move it into a folder.
es: El fichero %s está en el directorio raíz del proyecto. Autovala no lo permite. Debes moverlo dentro de un directorio.

source: Failed to store '%s: %s' at config
es: No se ha podido almacenar '%s: %s' en la configuración

source: Failed to write the CMakeLists file for custom file %s
es: Incapaz de escribir el fichero CMakeLists para el fichero personalizado (custom) %s

source: Failed to add binary %s
es: Incapaz de añadir el binario %s

source: Custom command needs two parameters (line %d)
es: El comando CUSTOM necesita dos parámetros (line %d)

source: Failed to store 'custom: %s %s' at config
es: No se ha podido almacenar 'custom: %s %s' en la configuración

source: Can't append DBUS data to the header CMakeLists file at %s
es: Incapaz de añadir los datos de DBUS en la cabecera del fichero CMakeLists en %s

source: Failed to write the CMakeLists file for %s
es: Incapaz de escribir el fichero CMakeLists de %s

source: Failed to write to meson.build header at '%s' element, at '%s' path: %s
es: No se ha podido escribir en la cabecera de meson.build en el elemento '%s', en la ruta '%s': %s

source: The DBus file %s at 'data' folder should be moved to 'data/dbus'
es: El fichero de DBus %s en 'data' debería moverse a 'data/dbus'

source: Failed to install local files at %s
es: Incapaz de instalar los ficheros locales de %s

source: Failed to write to meson.build file at '%s' element, at '%s' path: %s
es: No se ha podido escribir en el fichero meson.build en el elemento '%s', en la ruta '%s': %s

source: Failed to check if file %s is a GNome autostart file
es: No se ha podido comprobar si el fichero %s es un fichero de autoarranque de GNome

source: Failed to install document files at %s
es: Incapaz de instalar los ficheros de documentación de %s

source: External command needs two parameters (line %d)
es: El comando External necesita dos parámetros (line %d)

source: Failed to store 'external: %s %s' at config
es: No se ha podido almacenar 'external: %s %s' en la configuración

source: GRESOURCE command lacks path or identifier (line %d)
es: El comando GRESOURCE no tiene una ruta o identificador (línea %d)

source: The file %s, defined in the GResource file %s, doesn't exist
es: El fichero %s, definido en el fichero GResource %s, no existe

source: Failed to store 'gresource: %s %s' at config
es: No se ha podido almacenar 'gresource: %s %s' en la configuración

source: Failed to add glade %s
es: Incapaz de añadir el fichero glade %s

source: Can't add subdirectory %s
es: No ha sido posible añadir el subdirectorio %s

source: Failed to generate the main CMakeLists.txt file
es: Falló la creación del fichero CMakeLists principal

source: Failed to store a header
es: No se ha podido almacenar una cabecera

source: %s must have a cathegory and a theme (line %d)
es: %s tiene que tener una categoría y un tema (linea %d)

source: Can't get the size for icon %s
es: Incapaz de obtener el tamaño del icono %s

source: Can't find a suitable entry size in theme %s for the icon %s with size %d in context %s
es: No se puede encontrar una entrada adecuada en el tema %s para el icono %s con tamaño %d en el contexto %s

source: Can't get the canvas size for the icon %s; putting it in the biggest entry in context %s, theme %s
es: Incapaz de obtener el tamaño del icono %s; se añadirá en la entrada de mayor tamaño en el contexto %s, tema %s

source: Can't find a valid entry in context %s to install the icon %s in theme %s
es: Incapaz de encontrar una entrada válida en el contexto %s para instalar el icono %s en el tema %s

source: Unknown icon type %s. Must be .png or .svg (in lowercase)
es: Tipo de icono %s desconocido. Tiene que ser .png or .svg (en minúsculas)

source: The icon theme %s isn't installed in the system; can't get its data
es: El tema de iconos %s no está instalado en el sistema; no se pueden obtener sus datos

source: Failed to write the CMakeLists file for icon %s
es: Incapaz de escribir el fichero CMakeLists para el icono %s

source: Failed to write the PostData for icons at %s
es: Incapaz de escribir la PostData para los iconos en %s

source: Failed to store 'icon: %s' at config
es: No se ha podido almacenar 'icon: %s' en la configuración

source: This project has an INCLUDE statement, which is valid only for CMAKE. Maybe it will fail to build.
es: Este proyecto tiene un comando INCLUDE, que sólo es válido para CMAKE. Probablemente fallará al compilarlo.

source: Failed to write at '%s' element, at '%s' path: %s
es: No se ha podido escribir en el elemento '%s', en la ruta '%s': %s

source: Manpage command needs one, two or three parameters (line %d)
es: El comando Manpage necesita uno, dos o tres parámetros (línea %d)

source: Man page section must be a number between 1 and 9 (line %d)
es: La sección de una página de manual tiene que ser un número entre 1 y 9 (linea %d)

source: Failed to install MANpages at %s
es: Incapaz de instalar las páginas de manual en %s

source: Failed to store 'manpage: %s' at config
es: No se ha podido almacenar 'manpage: %s' en la configuración

source: Failed to add pixmap %s
es: Incapaz de añadir el pixmap %s

source: Failed to delete the old POTFILES.in file at %s
es: Incapaz de borrar el viejo fichero POTFILES.in en %s

source: Failed to create the PO files list
es: Falló la creación de la lista de ficheros PO

source: Failed to delete the old meson.build file at %s
es: No se ha podido borrar el viejo fichero meson.build en %s

source: Failed to add schema %s
es: Incapaz de añadir el schema %s

source: Trying to add twice the file %s for translation
es: Intentando añadir dos veces la ruta %s para traducción

source: Translate command without type at line %d
es: Comando de traducción si tipo en la línea %d

source: Failed to store '%s: %s %s' at config
es: No se ha podido almacenar '%s: %s %s' en la configuración

source: Can't generate the Regexps
es: No se han podido generar las expresiones regulares

source: Can't resolve 'Using %s'
es: No se ha podido resolver 'Using %s'

source: File %s is overwritting the version number (line %d)
es: Aviso: el fichero %s está sobreescribiendo el número de versión (línea %d)

source: The contruction 'const string project_version=...' in file %s is deprecated. Replace it with '// project version=...'
es: La construcción 'const string project_version=...' en el fichero %s está obsoleta. Debe sustituirse por '// project version=...'

source: File %s is overwritting the namespace (line %d)
es: El fichero %s está sobreescribiendo el namespace (línea %d)

source: Can't open for read the file %s
es: No se ha podido abrir el fichero %s para lectura

source: Syntax error in VERSION statement (line %d)
es: Error de sintaxis en el comando VERSION (línea %d)

source: Ignoring duplicated NAMESPACE command (line %d)
es: Ignorando comando NAMESPACE duplicado (línea %d)

source: Ignoring duplicated DESTINATION command (line %d)
es: Ignorando comando DESTINATION duplicado (línea %d)

source: DBus definitions can't be conditional (line %d)
es: Las definiciones de DBus no pueden ser condicionales (linea %d)

source: DBus definition must have three or four parameters (line %d)
es: La definición de DBus tiene que tener tres o cuatro parámetros (linea %d)

source: DBus bus must be either 'system' or 'session' (line %d)
es: El bus de DBus debe ser 'system' o 'session' (linea %d)

source: DBus library must be either 'gdbus' or 'dbus-glib' (line %d)
es: La biblioteca DBus debe ser 'gdbus' o 'dbus-glib' (linea %d)

source: Alias command is valid only inside Vala binaries (line %d)
es: El comando alias sólo es válido dentro de un binario Vala (linea %d)

source: Failed to write the header for binary file %s
es: Incapaz de escribir la cabecera para el fichero binario %s

source: Failed to delete the path %s
es: Incapaz de borrar el directorio %s

source: Failed to create the path %s
es: Falló la creación del directorio %s

source: Can't find dbus-send command
es: No se ha encontrado el comando dbus-send

source: Failed to execute '%s' with error message '%s'
es: No se ha podido ejecutar '%s'; se ha de vuelto el error '%s'

source: Failed to check temporary file /tmp/dbus_data.xml
es: No se ha creado el fichero temporal /tmp/dbus_data.xml

source: Can't find vala-dbus-binding-tool command
es: No se ha podido encontrar el comando vala-dbus-binding-tool

source: Failed to generate the DBus interface for the object %s (%s) at the bus '%s'
es: No se ha podido generar la interfaz DBus para el objeto %s (%s) en el bus '%s'

source: Failed to append the 'run sudo ldconfig' message
es: No se ha podido añadir el mensaje 'run sudo ldconfig'

source: Failed to create the Config.vala.base file
es: Falló la creación del fichero Config.vala.base

source: Failed to delete the old .DEPS file
es: Falló el borrado del antíguo fichero .DEPS

source: Failed to create the .DEPS file
es: Falló la creación del fichero .DEPS

source: Failed to find the local dependency '%s' for '%s'
es: Incapaz de encontrar la dependencia local '%s' para '%s'

source: Failed to create the .PC file
es: Falló la creación del fichero .PC

source: Can't set package %s for binary %s
es: No ha sido posible asignar el paquete %s para el binario %s

source: No namespace specified in library %s; GIR file will not be generated
es: No se ha especificado un namespace en la biblioteca %s; no se creará el fichero GIR

source: There are no compile options in %s
es: No hay opciones de compilación en %s

source: There are no C compile options in %s
es: No hay opciones de compilación de C en %s

source: Failed to write the CMakeLists file for binary %s
es: Incapaz de escribir el fichero CMakeLists del binario %s

source: Failed to store ': %s' at config
es: Incapaz de almacenar ':%s' en la configuración

source: Failed to generate regular expressions to analyze vala files: %s
es: No se pueden generar las expresiones regulares para leer los ficheros de vala: %s

source: Unknown file %s uses namespace GLib. Contact the author.
es: El fichero desconocido %s utiliza el namespace GLib. Contacte con el autor.

source: Warning:
es: Aviso:

source: File %s (GResource XML) doesn't exist
es: El fichero %s (GResource XML) no existe

source: Ilegal tag <%s>; should be <gresources>
es: Tag ilegal <%s>; debería ser <gresources>

source: Ilegal tag <%s>; should be <gresource>
es: Tag ilegal <%s>; debería ser <gresource>

source: Ilegal tag <%s>; should be <file>
es: Tag ilegal <%s>; debería ser <file>

source: GResource XML can't be deeper than 2
es: Los ficheros XML para GResource no pueden tener más de dos niveles

source: Failed to get installed vala compilers
es: Incapaz de obtener los compiladores de vala instalados

source: Failed to read the defaults file at ~/.config/autovala/packages.cfg: %s
es: No se han podido leer el fichero de configuraciones por defecto en ~/.config/autovala/packages.cfg: %s

source: Failed to read /etc/ld.so.conf: %s
es: Incapaz de leer /etc/ld.so.conf: %s

source: Failed to find any of the files: %s
es: No se ha podido encontrar ninguno de estos ficheros: %s

source: Failed to find dependencies for the non-check module %s
es: No se han podido encontrar las dependencias del módulo %s

source: Failed to find dependencies for the module %s, library %s
es: No se han podido encontrar las dependencias del módulo %s, biblioteca %s

source: Failed to add library %s to dependencies
es: Incapaz de añadir la biblioteca %s a las dependencias

source: Please enter your name (%s <%s>):
es: Por favor, teclee su nombre (%s <%s>):

source: Please enter your name:
es: Por favor, teclee su nombre:

source: Please enter your e-mail:
es: Por favor, teclee su correo-e:

source: Please enter your OS distribution name:
es: Por favor, teclee el nombre de su distribución:

source: Please enter your OS distribution name (%s):
es: Por favor, teclee el nombre de su distribución (%s):

source: Please enter your OS version name:
es: Por favor, teclee el nombre de la versión de su sistema operativo:

source: Please enter your OS version name (%s):
es: Por favor, teclee el nombre de la versión de su sistema operativo (%s):

source: Failed to process %s.vapi to find dependencies
es: Incapaz de procesar %s.vapi para encontrar sus dependencias

source: Failed to launch pkg-config for the module %s
es: No se ha podido lanzar pkg-config para el módulo %s

source: Error %d when launching pkg-config for the module %s
es: Error %d al lanzar pkg-config para el módulo %s

source: Exception '%s' when launching pkg-config for the module %s
es: Excepción '%s' al lanzar pkg-config para el módulo %s

source: Failed to read %s from an include originating at /etc/ld.so.conf: %s
es: No se ha podido leer %s desde un include de /etc/ld.so.conf: %s

source: Failed to read libraries from %s: %s
es: No se han podido leer las bibliotecas de %s: %s

source: Failed to create ~/.config/autovala folder: %s
es: Falló la creación del directorio ~/.config/autovala: %s

source: Failed to delete the old ~/.config/autovala/packages.cfg file: %s
es: No se ha podido borrar el viejo fichero ~/.config/autovala/packages.cfg %s

source: Filtering %s
es: Filtrando %s

source: Failed to launch apt for the file %s
es: Incapaz de lanzar apt para el fichero %s

source: Error %d when launching apt for the file %s
es: Error %d al lanzar apt para el fichero %s

source: Exception '%s' when launching apt for the file %s
es: Excepción '%s' al lanzar apt para el fichero %s

source: Failed to launch dpkg for the file %s
es: Incapaz de lanzar dpkg para el fichero %s

source: Can't find a package for the file %s
es: No se ha podido encontrar un paquete para el fichero %s

source: Error %d when launching dpkg for the file %s
es: Error %d al lanzar dpkg para el fichero %s

source: Exception '%s' when launching dpkg for the file %s
es: Excepción '%s' al lanzar dpkg para el fichero %s

source: Failed to delete debian/control file (%s)
es: No se ha podido borrar el fichero debian/control (%s)

source: Failed to write data to debian/control file (%s)
es: Incapaz de escribir datos en el fichero debian/control (%s)

source: Failed to write data to debian/rules file (%s)
es: Incapaz de escribir datos en el fichero debian/rules (%s)

source: Failed to delete invalid debian/rules file (%s)
es: No se ha podido borrar el fichero no válido debian/rules (%s)
